КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыПМ/КонтурЛогистика_ТипыПМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыПМ</name>
  <enumValues>
    <name>Отключен</name>
  </enumValues>
  <enumValues>
    <name>ВСоставеКонфигурации</name>
  </enumValues>
  <enumValues>
    <name>ФайлНаДиске</name>
  </enumValues>
  <enumValues>
    <name>ВСправочнике</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ПодключаемыйМодульПовтИсп/Module.bsl
// Это модуль-инициализатор. Здесь не нужно писать обработчики.
// Пишите обработчики в обработке КонтурЛогистика_ПодключаемыйМодуль 

// Возвращает инициализированный подключаемый модуль (обработку)
// обработка может быть внешняя или из метаданных конфигурации в зависимости от общей настройки "Тип ПМ (вариант подключения)"
//  - Файл на диске
//  - В составе конфигурации
// 
// Возвращаемое значение:
//   - ВнешняяОбработка, Обработка
//
Функция ПодключаемыйМодуль() Экспорт
	
	ВнешнийМодуль = Неопределено;
	ПодключаемыйМодульТип = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПодключаемыйМодульТип");
	
	Если Не ЗначениеЗаполнено(ПодключаемыйМодульТип) 
		Или ПодключаемыйМодульТип = Перечисления.КонтурЛогистика_ТипыПМ.Отключен Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	// Если ПМ Подключен
	Если ПодключаемыйМодульТип = Перечисления.КонтурЛогистика_ТипыПМ.ВСоставеКонфигурации Тогда
		
			Попытка
				
				ВнешнийМодуль = Обработки.КонтурЛогистика_ПодключаемыйМодуль.Создать();
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось подключить внешний модуль из конфигурации -" + ОписаниеОшибки();
				Сообщение.Сообщить();
				
			КонецПопытки;
			
	Иначе
		
		ИмяФайла = ПолучитьПутьКФайлуПодключаемогоМодуля(ПодключаемыйМодульТип); 
	
		Если ИмяФайла = Неопределено Тогда
			Сообщить("Не удалось подключить внешний модуль!");
		Иначе
			Попытка
				Попытка
					Выполнить("
					|ОбъектОписанияЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
					|ОбъектОписанияЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
					|ВнешнийМодуль = ВнешниеОбработки.Создать(ИмяФайла, Ложь, ОбъектОписанияЗащиты);")
					
				Исключение
					
					ВнешнийМодуль = ВнешниеОбработки.Создать(ИмяФайла, Ложь);//в небезопасном режиме, т.к. ПМ может содержать небезопасный код
					
				КонецПопытки;
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось подключить внешний модуль из файла или справочника внешних обработок - " + ОписаниеОшибки();
				Сообщение.Сообщить();
								
			КонецПопытки;
			
			// если доставали из справочника - удалить временный файл
			Если ПодключаемыйМодульТип = Перечисления.КонтурЛогистика_ТипыПМ.ВСправочнике Тогда 
				УдалитьФайлы(ИмяФайла);
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Возврат ВнешнийМодуль;
	
	
КонецФункции

// только если он хранится на диске, либо во внешних обработках
Функция ПолучитьПутьКФайлуПодключаемогоМодуля(ПодключаемыйМодульТип, ИмяНастройки = "ПодключаемыйМодульПуть") Экспорт 
	
	ПодключаемыйМодульПуть = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки(ИмяНастройки);
	
	Если ЗначениеЗаполнено(ПодключаемыйМодульПуть) Тогда
		
		Если ПодключаемыйМодульТип = Перечисления.КонтурЛогистика_ТипыПМ.ФайлНаДиске Тогда
			
			Возврат ПодключаемыйМодульПуть;
			
		ИначеЕсли ПодключаемыйМодульТип = Перечисления.КонтурЛогистика_ТипыПМ.ВСправочнике Тогда
			
			Попытка
				
				ИмяРеквизита = "";
				ВнешняяОбработкаСсылка = ПодключаемыйМодульПуть;
				
				Если ЗначениеЗаполнено(ВнешняяОбработкаСсылка) Тогда
					
					МетаданныеСправочника = ВнешняяОбработкаСсылка.Метаданные();
					ИмяТиповогоРеквизита = "";
					
					Если Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
						ИмяТиповогоРеквизита = "ХранилищеОбработки";    //типовое название реквизита
					КонецЕсли;
					
					Для Каждого Реквизит Из МетаданныеСправочника.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
							ИмяРеквизита = Реквизит.Имя;
							// будем брать последний реквизит такого типа т.к. это более вероятно, если найдем наш - гуд
							Если ИмяТиповогоРеквизита = Реквизит.Имя Тогда
								Прервать;  // найден ожидаемый реквизит нужного типа
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
						
						МодульОбъект = ВнешняяОбработкаСсылка.ПолучитьОбъект();
						ИмяФайла = ПолучитьИмяВременногоФайла("epf");
						ДвоичныеДанные = МодульОбъект[ИмяРеквизита].Получить();
						ДвоичныеДанные.Записать(ИмяФайла);
												
						Возврат ИмяФайла;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Исключение
				
				КонтурЛогистика_Метрика.ОбработатьОшибку("ПолучитьПутьКФайлуПодключаемогоМодуля", ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
